HalloYang06/PSOC_E84_robot/applications/main.c
#include <rtthread.h>
#include <rtdevice.h>
#include <board.h>
#include <fal.h>
#include <finsh.h>
#include <reent.h>
#include <arpa/inet.h>
#include <sys/socket.h>
#include <errno.h>
#include <stdlib.h>
#include "cy_retarget_io.h"
#include "whd.h"
#include "whd_resource_api.h"
#include "http_server.h"
#include "m33_m55_comm.h"
#include "model_result_publisher.h"
#include "openclaw_integration.h"
#include "voice_service.h"
#include "websocket_client.h"
#include "wifi_config_service.h"
#include "xiaozhi_voice_relay.h"

#ifdef BSP_USING_LVGL
extern int lvgl_thread_init(void);
#endif

#define LED_PIN_G GET_PIN(16, 6)
#define M55_AUDIO_SAMPLE_RATE 16000
#define M55_AUDIO_BITS_PER_SAMPLE 16
#define M55_AUDIO_FRAME_BYTES 2048
#define M55_VOICE_BOOT_DELAY_MS 5000
#define M55_BOOT_SELF_TEST_RETRY_COUNT 10
#define M55_XIAOZHI_CLOUD_IP "106.55.62.122"
#define M55_XIAOZHI_CLOUD_PORT 8011
#ifndef M55_WIFI_SCAN_QA_ONLY
#define M55_WIFI_SCAN_QA_ONLY 0
#endif
#ifndef M55_WIFI_LVGL_ONLY
#define M55_WIFI_LVGL_ONLY 1
#endif
#ifndef M55_XIAOZHI_AUTO_ENABLE
#define M55_XIAOZHI_AUTO_ENABLE 1
#endif
#ifndef M55_ENABLE_LOCAL_HTTP_SERVER
#define M55_ENABLE_LOCAL_HTTP_SERVER 0
#endif
#ifdef ENABLE_STEREO_INPUT_FEED
#define M55_AUDIO_CHANNELS 2
#define M55_AUDIO_MONO_FRAME_BYTES (M55_AUDIO_FRAME_BYTES / 2)
#else
#define M55_AUDIO_CHANNELS 1
#define M55_AUDIO_MONO_FRAME_BYTES M55_AUDIO_FRAME_BYTES
#endif

__attribute__((weak)) struct _reent _impure_data;

static struct
{
    rt_device_t dev;
    rt_thread_t thread;
    rt_bool_t running;
    rt_uint8_t buffer[M55_AUDIO_FRAME_BYTES];
    rt_uint8_t mono_buffer[M55_AUDIO_MONO_FRAME_BYTES];
} g_m55_mic = {0};
static rt_thread_t g_voice_boot_thread = RT_NULL;
static rt_thread_t g_boot_self_test_thread = RT_NULL;
static rt_thread_t g_xiaozhi_bridge_thread = RT_NULL;
static rt_thread_t g_xiaozhi_auto_thread = RT_NULL;
static rt_bool_t g_xiaozhi_voice_started = RT_FALSE;

typedef struct
{
    rt_uint32_t magic;
    rt_uint32_t phase;
    rt_int32_t init_ret;
    rt_int32_t whd_diag_ret_before;
    rt_int32_t scan_start_ret;
    rt_int32_t whd_diag_ret_after;
    rt_uint32_t wait_loops;
    wifi_config_snapshot_t snapshot;
    wifi_config_ap_t aps[WIFI_CONFIG_SCAN_MAX_APS];
} m55_wifi_scan_qa_t;

volatile m55_wifi_scan_qa_t g_m55_wifi_scan_qa;

extern whd_resource_source_t resource_ops;
int lwip_socket(int domain, int type, int protocol);
int lwip_connect(int s, const struct sockaddr *name, socklen_t namelen);
int lwip_close(int s);
static rt_err_t m55_voice_start_for_xiaozhi(void);
static void xiaozhi_bridge_publish_status(void);

static void m55_wifi_scan_qa_capture(void)
{
    rt_int32_t i;
    wifi_config_snapshot_t snapshot;

    wifi_config_get_snapshot(&snapshot);
    g_m55_wifi_scan_qa.snapshot = snapshot;

    for (i = 0; i < WIFI_CONFIG_SCAN_MAX_APS; i++)
    {
        wifi_config_ap_t ap;

        rt_memset(&ap, 0, sizeof(ap));
        if ((i < snapshot.scan_count) && (wifi_config_get_scan_ap(i, &ap) == RT_EOK))
        {
            g_m55_wifi_scan_qa.aps[i] = ap;
        }
        else
        {
            rt_memset((void *)&g_m55_wifi_scan_qa.aps[i], 0, sizeof(g_m55_wifi_scan_qa.aps[i]));
        }
    }
}

static void m55_wifi_scan_qa_thread_entry(void *parameter)
{
    rt_uint32_t i;
    wifi_config_snapshot_t snapshot;

    RT_UNUSED(parameter);

    rt_memset((void *)&g_m55_wifi_scan_qa, 0, sizeof(g_m55_wifi_scan_qa));
    g_m55_wifi_scan_qa.magic = 0x57465141U; /* WFQA */
    g_m55_wifi_scan_qa.phase = 1U;

    g_m55_wifi_scan_qa.init_ret = wifi_config_service_init();
    g_m55_wifi_scan_qa.phase = 2U;
    for (i = 0; i < 45U; i++)
    {
        rt_thread_mdelay(1000);
        g_m55_wifi_scan_qa.whd_diag_ret_before = wifi_config_whd_diag();
        m55_wifi_scan_qa_capture();
        wifi_config_get_snapshot(&snapshot);
        if ((snapshot.whd_stage >= 19) && (snapshot.netdev_name[0] != '\0'))
        {
            break;
        }
    }
    g_m55_wifi_scan_qa.phase = 3U;

    g_m55_wifi_scan_qa.scan_start_ret = wifi_config_scan();
    for (i = 0; i < 30U; i++)
    {
        rt_thread_mdelay(1000);
        g_m55_wifi_scan_qa.wait_loops = i + 1U;
        m55_wifi_scan_qa_capture();
        if (g_m55_wifi_scan_qa.snapshot.scan_running == 0U &&
            g_m55_wifi_scan_qa.snapshot.scan_request_count > 0U)
        {
            break;
        }
    }

    g_m55_wifi_scan_qa.whd_diag_ret_after = wifi_config_whd_diag();
    m55_wifi_scan_qa_capture();
    g_m55_wifi_scan_qa.phase = 4U;

    rt_kprintf("[wifi_qa] done init=%ld whd_before=%ld scan_start=%ld scan_result=%ld count=%ld cb=%lu done=%lu timeout=%lu whd_after=%ld\n",
               (long)g_m55_wifi_scan_qa.init_ret,
               (long)g_m55_wifi_scan_qa.whd_diag_ret_before,
               (long)g_m55_wifi_scan_qa.scan_start_ret,
               (long)g_m55_wifi_scan_qa.snapshot.scan_result,
               (long)g_m55_wifi_scan_qa.snapshot.scan_count,
               (unsigned long)g_m55_wifi_scan_qa.snapshot.scan_callback_count,
               (unsigned long)g_m55_wifi_scan_qa.snapshot.scan_done_count,
               (unsigned long)g_m55_wifi_scan_qa.snapshot.scan_timeout_count,
               (long)g_m55_wifi_scan_qa.whd_diag_ret_after);
}

static void m55_console_detach(void)
{
    cy_retarget_io_deinit();
    rt_console_set_device("");
}

static void dump_hex(const char *title, const rt_uint8_t *raw, rt_size_t size)
{
    rt_size_t i;

    rt_kprintf("%s\n", title);
    for (i = 0; i < size; i++)
    {
        rt_kprintf("%02x ", raw[i]);
        if ((i % 16) == 15)
        {
            rt_kprintf("\n");
        }
    }
    if ((size % 16) != 0)
    {
        rt_kprintf("\n");
    }
}

static void whd_dump_head(int argc, char **argv)
{
    const struct fal_partition *part;
    rt_uint8_t raw[32] = {0};

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    part = fal_partition_find("whd_firmware");
    if (!part)
    {
        rt_kprintf("whd_firmware partition not found\n");
        return;
    }

    if (fal_partition_read(part, 0, raw, sizeof(raw)) < 0)
    {
        rt_kprintf("read whd_firmware failed\n");
        return;
    }

    dump_hex("whd_firmware head:", raw, sizeof(raw));
}
MSH_CMD_EXPORT(whd_dump_head, Dump first 32 bytes of whd_firmware partition);

static void whd_dump_block0(int argc, char **argv)
{
    const rt_uint8_t *data = RT_NULL;
    rt_uint8_t copy[32] = {0};
    uint32_t size_out = 0;
    uint32_t result;
    uint32_t fw_size = 0;
    rt_size_t dump_size;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    result = resource_ops.whd_resource_size(RT_NULL, WHD_RESOURCE_WLAN_FIRMWARE, &fw_size);
    rt_kprintf("whd_resource_size result=%u size=%u\n", result, fw_size);
    if (result != 0)
    {
        return;
    }

    result = resource_ops.whd_get_resource_block(RT_NULL, WHD_RESOURCE_WLAN_FIRMWARE, 0, &data, &size_out);
    rt_kprintf("whd_get_resource_block result=%u block0_size=%u data=%p\n", result, size_out, data);
    if (result != 0 || data == RT_NULL)
    {
        return;
    }

