HalloYang06/PSOC_E84_robot/applications/main.c
    dump_size = size_out < sizeof(copy) ? size_out : sizeof(copy);
    rt_memcpy(copy, data, dump_size);
    dump_hex("whd firmware block0:", copy, dump_size);
}
MSH_CMD_EXPORT(whd_dump_block0, Dump first 32 bytes of WHD firmware block0);

static void openclaw_dump_status(int argc, char **argv)
{
    char json[OPENCLAW_JSON_MEDIUM];

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    openclaw_build_status_json(json, sizeof(json));
    rt_kprintf("%s\n", json);
}
MSH_CMD_EXPORT(openclaw_dump_status, Dump OpenClaw bridge status as JSON);

static void m55_mic_thread_entry(void *parameter)
{
    rt_size_t read_len;
    rt_uint32_t frame_count = 0;
    rt_uint32_t peak = 0;

    RT_UNUSED(parameter);

    while (g_m55_mic.running)
    {
        read_len = rt_device_read(g_m55_mic.dev, 0, g_m55_mic.buffer, sizeof(g_m55_mic.buffer));
        if (read_len > 0)
        {
            rt_size_t i;
            rt_uint32_t local_peak = 0;
            rt_int16_t *samples = (rt_int16_t *)g_m55_mic.buffer;
            rt_size_t sample_count = read_len / sizeof(rt_int16_t);

            for (i = 0; i < sample_count; i++)
            {
                rt_uint32_t mag = (samples[i] < 0) ? (rt_uint32_t)(-samples[i]) : (rt_uint32_t)samples[i];
                if (mag > local_peak)
                {
                    local_peak = mag;
                }
            }

            if (local_peak > peak)
            {
                peak = local_peak;
            }

            frame_count++;
            if ((frame_count % 10U) == 0U)
            {
                rt_kprintf("[m55_mic] read ok len=%u peak=%u frames=%u\n",
                           (unsigned)read_len,
                           (unsigned)peak,
                           (unsigned)frame_count);
                peak = 0;
            }

#ifdef ENABLE_STEREO_INPUT_FEED
            {
                rt_int16_t *mono_samples = (rt_int16_t *)g_m55_mic.mono_buffer;
                rt_size_t mono_count = sample_count / 2U;

                for (i = 0; i < mono_count; i++)
                {
                    mono_samples[i] = samples[(i * 2U) + 1U];
                }
                (void)voice_service_submit_local_pcm(g_m55_mic.mono_buffer,
                                                     (rt_uint32_t)(mono_count * sizeof(rt_int16_t)));
            }
#else
            (void)voice_service_submit_local_pcm(g_m55_mic.buffer, (rt_uint32_t)read_len);
#endif
        }
        else
        {
            rt_thread_mdelay(10);
        }
    }
}

static rt_err_t m55_mic_start_internal(void)
{
    struct rt_audio_caps caps;

    if (g_m55_mic.running)
    {
        return -RT_EBUSY;
    }

    if (g_m55_mic.dev == RT_NULL)
    {
        g_m55_mic.dev = rt_device_find("mic0");
        if (g_m55_mic.dev == RT_NULL)
        {
            rt_kprintf("[m55_mic] mic0 not found\n");
            return -RT_ERROR;
        }

        if (rt_device_open(g_m55_mic.dev, RT_DEVICE_OFLAG_RDONLY) != RT_EOK)
        {
            rt_kprintf("[m55_mic] open mic0 failed\n");
            g_m55_mic.dev = RT_NULL;
            return -RT_ERROR;
        }

        rt_memset(&caps, 0, sizeof(caps));
        caps.main_type = AUDIO_TYPE_INPUT;
        caps.sub_type = AUDIO_DSP_PARAM;
        caps.udata.config.samplerate = M55_AUDIO_SAMPLE_RATE;
        caps.udata.config.channels = M55_AUDIO_CHANNELS;
        caps.udata.config.samplebits = M55_AUDIO_BITS_PER_SAMPLE;
        if (rt_device_control(g_m55_mic.dev, AUDIO_CTL_CONFIGURE, &caps) == RT_EOK)
        {
            rt_kprintf("[m55_mic] configured mic0 sr=%d ch=%d bits=%d\n",
                       M55_AUDIO_SAMPLE_RATE,
                       M55_AUDIO_CHANNELS,
                       M55_AUDIO_BITS_PER_SAMPLE);
        }
        else
        {
            rt_kprintf("[m55_mic] configure mic0 failed\n");
        }
    }

    g_m55_mic.running = RT_TRUE;
    g_m55_mic.thread = rt_thread_create("m55_mic",
                                        m55_mic_thread_entry,
                                        RT_NULL,
                                        4096,
                                        18,
                                        10);
    if (g_m55_mic.thread == RT_NULL)
    {
        g_m55_mic.running = RT_FALSE;
        rt_kprintf("[m55_mic] create thread failed\n");
        return -RT_ERROR;
    }

    rt_thread_startup(g_m55_mic.thread);
    rt_kprintf("[m55_mic] started\n");
    return RT_EOK;
}

static rt_err_t m55_mic_stop_internal(void)
{
    if (!g_m55_mic.running)
    {
        return RT_EOK;
    }

    g_m55_mic.running = RT_FALSE;
    rt_thread_mdelay(50);
    g_m55_mic.thread = RT_NULL;
    rt_kprintf("[m55_mic] stopped\n");
    return RT_EOK;
}

static void m55_mic_test(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_mic_start_internal();
    rt_kprintf("m55_mic_test ret=%d\n", ret);
}
MSH_CMD_EXPORT(m55_mic_test, Start local CM55 mic0 capture test);

static void m55_mic_stop(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_mic_stop_internal();
    rt_kprintf("m55_mic_stop ret=%d\n", ret);
}
MSH_CMD_EXPORT(m55_mic_stop, Stop local CM55 mic0 capture test);

static void voice_test(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_request_capture_start();
    rt_kprintf("voice_test ret=%d\n", ret);
}
MSH_CMD_EXPORT(voice_test, Trigger M33 voice capture from M55);

static void voice_stop(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_request_capture_stop();
    rt_kprintf("voice_stop ret=%d\n", ret);
}
MSH_CMD_EXPORT(voice_stop, Stop M33 voice capture from M55);

static void wake_on(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_request_listen_start();
    rt_kprintf("wake_on ret=%d\n", ret);
}
MSH_CMD_EXPORT(wake_on, Start continuous wake listening on M33->CM55);

