HalloYang06/PSOC_E84_robot/applications/main.c
static void xz_talk_on(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = m55_voice_start_for_xiaozhi();
    if (ret == RT_EOK)
    {
        ret = voice_service_start_xiaozhi_talk();
    }
    if (ret == RT_EOK)
    {
        ret = m55_mic_start_internal();
    }

    rt_kprintf("xz_talk_on ret=%d token=%d connected=%d ws_stage=%d ws_errno=%d\n",
               ret,
               xiaozhi_voice_relay_has_token() ? 1 : 0,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
}
MSH_CMD_EXPORT(xz_talk_on, Start manual Xiaozhi cloud listening from CM55 mic);

static void xz_talk_off(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_stop_xiaozhi_talk();
    (void)m55_mic_stop_internal();
    rt_kprintf("xz_talk_off ret=%d connected=%d ws_stage=%d ws_errno=%d\n",
               ret,
               websocket_client_is_connected() ? 1 : 0,
               websocket_client_last_stage(),
               websocket_client_last_errno());
}
MSH_CMD_EXPORT(xz_talk_off, Stop manual Xiaozhi cloud listening);

static void xiaozhi_bridge_publish_ack(rt_uint32_t cmd, rt_err_t ret)
{
    m33_m55_message_t ack;

    rt_memset(&ack, 0, sizeof(ack));
    ack.type = MSG_TYPE_VOICE_CONTROL_ACK;
    ack.payload.voice_control.cmd = cmd;
    ack.payload.voice_control.arg0 = (rt_uint32_t)ret;
    ack.payload.voice_control.arg1 = (rt_uint32_t)rt_tick_get();
    (void)m33_m55_comm_publish(&ack);
}

static void xiaozhi_bridge_publish_status(void)
{
    m33_m55_message_t status;

    rt_memset(&status, 0, sizeof(status));
    status.type = MSG_TYPE_VOICE_STATUS;
    status.payload.voice_status.flags =
        xiaozhi_voice_relay_has_token() ? VOICE_STATUS_FLAG_XIAOZHI_HAS_TOKEN : 0U;
    wifi_config_fill_voice_status(&status.payload.voice_status);
    (void)m33_m55_comm_publish(&status);
}

static rt_err_t xiaozhi_bridge_handle_config(const voice_config_msg_t *config)
{
    rt_err_t ret = RT_EOK;

    if (config == RT_NULL)
    {
        return -RT_EINVAL;
    }

    switch ((voice_config_key_t)config->key)
    {
    case VOICE_CONFIG_XIAOZHI_URL:
        ret = xiaozhi_voice_relay_set_url(config->value);
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN:
        ret = xiaozhi_voice_relay_set_token(config->value);
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN_BEGIN:
        ret = xiaozhi_voice_relay_token_update_begin();
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN_PART:
        ret = xiaozhi_voice_relay_token_update_part(config->value);
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN_COMMIT:
        ret = xiaozhi_voice_relay_token_update_commit();
        break;
    case VOICE_CONFIG_XIAOZHI_TOKEN_CLEAR:
        xiaozhi_voice_relay_token_update_clear();
        ret = RT_EOK;
        break;
    case VOICE_CONFIG_XIAOZHI_RECONNECT:
        ret = m55_voice_start_for_xiaozhi();
        if (ret == RT_EOK)
        {
            g_xiaozhi_voice_started = RT_TRUE;
            ret = voice_service_reconnect_xiaozhi();
        }
        break;
    case VOICE_CONFIG_WIFI_SSID:
        ret = wifi_config_set_ssid(config->value);
        break;
    case VOICE_CONFIG_WIFI_PASSWORD:
        ret = wifi_config_set_password(config->value);
        break;
    case VOICE_CONFIG_WIFI_CONNECT:
        (void)wifi_config_save();
        ret = wifi_config_start_auto_connect(10U);
        break;
    case VOICE_CONFIG_WIFI_DISCONNECT:
        ret = wifi_config_disconnect();
        break;
    case VOICE_CONFIG_WIFI_SAVE:
        ret = wifi_config_save();
        break;
    case VOICE_CONFIG_WIFI_FORGET:
        ret = wifi_config_forget();
        break;
    case VOICE_CONFIG_WIFI_AUTO_CONNECT:
        ret = wifi_config_set_auto_connect((config->value[0] == '0') ? RT_FALSE : RT_TRUE);
        if (ret == RT_EOK)
        {
            ret = wifi_config_save();
        }
        break;
    default:
        ret = -RT_EINVAL;
        break;
    }

    rt_kprintf("[m55_xz_bridge] config key=%lu ret=%d token=%d\n",
               (unsigned long)config->key,
               ret,
               xiaozhi_voice_relay_has_token() ? 1 : 0);
    return ret;
}

static rt_err_t xiaozhi_bridge_handle_control(const voice_control_msg_t *control)
{
    rt_err_t ret = RT_EOK;

    if (control == RT_NULL)
    {
        return -RT_EINVAL;
    }

    switch ((voice_control_cmd_t)control->cmd)
    {
    case VOICE_CTRL_START_CAPTURE:
        ret = m55_voice_start_for_xiaozhi();
        if (ret == RT_EOK)
        {
            g_xiaozhi_voice_started = RT_TRUE;
            ret = voice_service_start_xiaozhi_talk();
        }
        break;
    case VOICE_CTRL_STOP_CAPTURE:
        ret = voice_service_stop_xiaozhi_talk();
        break;
    case VOICE_CTRL_START_LISTEN:
        ret = m55_wake_listen_start_for_xiaozhi();
        if (ret == RT_EOK)
        {
            g_xiaozhi_voice_started = RT_TRUE;
        }
        break;
    case VOICE_CTRL_STOP_LISTEN:
        ret = m55_wake_listen_stop_for_xiaozhi();
        break;
    case VOICE_CTRL_WIFI_DIAG:
        ret = wifi_config_diag();
        break;
    case VOICE_CTRL_WIFI_SCAN:
        ret = wifi_config_scan();
        break;
    case VOICE_CTRL_WHD_DIAG:
        ret = wifi_config_whd_diag();
        break;
    default:
        ret = -RT_EINVAL;
        break;
    }

    rt_kprintf("[m55_xz_bridge] control cmd=%lu ret=%d\n",
               (unsigned long)control->cmd,
               ret);
    return ret;
}

static void xiaozhi_bridge_thread_entry(void *parameter)
{
    m33_m55_message_t msg;

    RT_UNUSED(parameter);

    (void)m33_m55_comm_init();
    (void)xiaozhi_voice_relay_init();
    rt_kprintf("[m55_xz_bridge] ready token=%d url=%s\n",
               xiaozhi_voice_relay_has_token() ? 1 : 0,
               xiaozhi_voice_relay_get_url());

    while (!g_xiaozhi_voice_started)
    {
        while (m33_m55_comm_consume(&msg) == RT_EOK)
        {
            rt_err_t ret = -RT_EINVAL;

