HalloYang06/PSOC_E84_robot/applications/main.c
            if (msg.type == MSG_TYPE_VOICE_CONFIG)
            {
                ret = xiaozhi_bridge_handle_config(&msg.payload.voice_config);
                xiaozhi_bridge_publish_ack(1000U + msg.payload.voice_config.key, ret);
                xiaozhi_bridge_publish_status();
            }
            else if (msg.type == MSG_TYPE_VOICE_CONTROL)
            {
                ret = xiaozhi_bridge_handle_control(&msg.payload.voice_control);
                xiaozhi_bridge_publish_ack(msg.payload.voice_control.cmd, ret);
                xiaozhi_bridge_publish_status();
            }
        }

        rt_thread_mdelay(50);
    }

    rt_kprintf("[m55_xz_bridge] handoff to voice_service\n");
    g_xiaozhi_bridge_thread = RT_NULL;
}

static void m55_wifi_ssid(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: m55_wifi_ssid <ssid>\n");
        return;
    }

    ret = wifi_config_set_ssid(argv[1]);
    rt_kprintf("m55_wifi_ssid ret=%d len=%lu\n", ret, (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(m55_wifi_ssid, Set CM55 WiFi SSID in RAM);

static void m55_wifi_password(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: m55_wifi_password <password>\n");
        return;
    }

    ret = wifi_config_set_password(argv[1]);
    rt_kprintf("m55_wifi_password ret=%d len=%lu\n", ret, (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(m55_wifi_password, Set CM55 WiFi password in RAM);

static void m55_wifi_connect(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_save ret=%d\n", wifi_config_save());
    rt_kprintf("m55_wifi_connect ret=%d\n", wifi_config_connect());
}
MSH_CMD_EXPORT(m55_wifi_connect, Connect CM55 WiFi using staged SSID/password);

static void m55_wifi_save(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_save ret=%d\n", wifi_config_save());
}
MSH_CMD_EXPORT(m55_wifi_save, Save CM55 WiFi SSID/password to local flash);

static void m55_wifi_forget(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_forget ret=%d\n", wifi_config_forget());
}
MSH_CMD_EXPORT(m55_wifi_forget, Remove saved CM55 WiFi credentials);

static void m55_wifi_auto(int argc, char **argv)
{
    rt_bool_t enable;

    if (argc < 2)
    {
        wifi_config_snapshot_t snapshot;
        wifi_config_get_snapshot(&snapshot);
        rt_kprintf("usage: m55_wifi_auto <0|1>, current=%lu\n",
                   (unsigned long)snapshot.auto_connect);
        return;
    }

    enable = (argv[1][0] != '0') ? RT_TRUE : RT_FALSE;
    rt_kprintf("m55_wifi_auto ret=%d\n", wifi_config_set_auto_connect(enable));
    rt_kprintf("m55_wifi_save ret=%d\n", wifi_config_save());
}
MSH_CMD_EXPORT(m55_wifi_auto, Enable or disable saved WiFi auto-connect);

static void m55_wifi_status(int argc, char **argv)
{
    wifi_config_snapshot_t snapshot;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    wifi_config_get_snapshot(&snapshot);
    rt_kprintf("[wifi_config] ssid=%s saved=%lu auto=%lu storage=%ld connected=%lu ready=%lu rssi=%ld netdev=%s flags=0x%lx last=%ld whd=%ld/%ld\n",
               snapshot.ssid[0] ? snapshot.ssid : "(empty)",
               (unsigned long)snapshot.saved,
               (unsigned long)snapshot.auto_connect,
               (long)snapshot.storage_result,
               (unsigned long)snapshot.wlan_connected,
               (unsigned long)snapshot.wlan_ready,
               (long)snapshot.wlan_rssi,
               snapshot.netdev_name[0] ? snapshot.netdev_name : "(none)",
               (unsigned long)snapshot.netdev_flags,
               (long)snapshot.last_result,
               (long)snapshot.whd_stage,
               (long)snapshot.whd_result);
}
MSH_CMD_EXPORT(m55_wifi_status, Print saved CM55 WiFi config and live status);

static void m55_wifi_print_aps(void)
{
    rt_int32_t i;
    rt_int32_t count = wifi_config_get_scan_count();

    rt_kprintf("[wifi_config] cached_ap_count=%ld\n", (long)count);
    if (count <= 0)
    {
        rt_kprintf("[wifi_config] no cached APs; run m55_wifi_scan and wait a few seconds\n");
        return;
    }

    for (i = 0; (i < count) && (i < WIFI_CONFIG_SCAN_MAX_APS); i++)
    {
        wifi_config_ap_t ap;

        if (wifi_config_get_scan_ap(i, &ap) != RT_EOK)
        {
            continue;
        }

        rt_kprintf("[wifi_config] ap[%ld] ssid=\"%s\" rssi=%ld security=%s channel=%ld bssid=%02x:%02x:%02x:%02x:%02x:%02x\n",
                   (long)i,
                   ap.ssid[0] ? ap.ssid : "(hidden)",
                   (long)ap.rssi,
                   wifi_config_security_name(ap.security),
                   (long)ap.channel,
                   ap.bssid[0],
                   ap.bssid[1],
                   ap.bssid[2],
                   ap.bssid[3],
                   ap.bssid[4],
                   ap.bssid[5]);
    }
}

static void m55_wifi_aps(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    m55_wifi_print_aps();
}
MSH_CMD_EXPORT(m55_wifi_aps, Print cached CM55 WiFi scan results);

static void m55_wifi_disconnect(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_disconnect ret=%d\n", wifi_config_disconnect());
}
MSH_CMD_EXPORT(m55_wifi_disconnect, Disconnect CM55 WiFi);

static void m55_wifi_diag(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    (void)wifi_config_diag();
    (void)wifi_config_whd_diag();
}
MSH_CMD_EXPORT(m55_wifi_diag, Print CM55 WiFi and WHD diagnostics);

static void m55_wifi_scan(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_scan ret=%d\n", wifi_config_scan());
    rt_kprintf("wait 3-5 seconds, then run m55_wifi_aps or refresh LVGL with Diag\n");
    m55_wifi_print_aps();
}
MSH_CMD_EXPORT(m55_wifi_scan, Start CM55 WiFi scan);

static void voice_boot_thread_entry(void *parameter)
{
    rt_err_t ret;
    const char *api_key = "YOUR_BAIDU_API_KEY";
    const char *secret_key = "YOUR_BAIDU_SECRET_KEY";

    RT_UNUSED(parameter);

    rt_thread_mdelay(M55_VOICE_BOOT_DELAY_MS);
    rt_kprintf("[m55] starting voice service\n");

    ret = voice_service_init(api_key, secret_key);
    if (ret != RT_EOK)
    {
        rt_kprintf("Voice service init failed: %d\n", ret);
        g_voice_boot_thread = RT_NULL;
        return;
    }

    rt_kprintf("[m55] voice service initialized\n");
    ret = voice_service_start();
    if (ret != RT_EOK)
    {
        rt_kprintf("Voice service start failed: %d\n", ret);
    }
    else
    {
        ret = m55_mic_start_internal();
        rt_kprintf("[m55] local mic autostart ret=%d\n", ret);
    }

    g_voice_boot_thread = RT_NULL;
}

