HalloYang06/PSOC_E84_robot/applications/main.c
static void boot_self_test_thread_entry(void *parameter)
{
    int i;

    RT_UNUSED(parameter);

    for (i = 0; i < M55_BOOT_SELF_TEST_RETRY_COUNT; i++)
    {
        rt_err_t ret = model_result_publish_boot_self_test();
        rt_kprintf("[m55] boot self-test publish ret=%d try=%d\n", ret, i + 1);
        rt_thread_mdelay(1000);
    }

    g_boot_self_test_thread = RT_NULL;
}

int main(void)
{
    rt_err_t ret;
#if M55_WIFI_SCAN_QA_ONLY
    rt_thread_t wifi_qa_thread;
#endif

    rt_kprintf("Hello RT-Thread\r\n");
    rt_kprintf("This core is cortex-m55\n");

    rt_pin_mode(LED_PIN_G, PIN_MODE_OUTPUT);

#if M55_WIFI_SCAN_QA_ONLY
    rt_kprintf("[m55] WiFi scan QA-only mode; LVGL/voice/OpenClaw/HTTP/autoconnect disabled\n");
    wifi_qa_thread = rt_thread_create("wifi_qa",
                                      m55_wifi_scan_qa_thread_entry,
                                      RT_NULL,
                                      4096,
                                      28,
                                      10);
    if (wifi_qa_thread)
    {
        rt_thread_startup(wifi_qa_thread);
    }

    while (1)
    {
        rt_pin_write(LED_PIN_G, PIN_LOW);
        rt_thread_mdelay(200);
        rt_pin_write(LED_PIN_G, PIN_HIGH);
        rt_thread_mdelay(800);
    }
#else
    (void)wifi_config_service_init();

#ifdef BSP_USING_LVGL
    rt_kprintf("[m55] starting LVGL thread\n");
    ret = lvgl_thread_init();
    rt_kprintf("[m55] LVGL thread init ret=%d\n", ret);
#endif

#if !M55_WIFI_LVGL_ONLY
    (void)wifi_config_start_auto_connect(3500U);

    g_boot_self_test_thread = rt_thread_create("m55_self",
                                               boot_self_test_thread_entry,
                                               RT_NULL,
                                               2048,
                                               15,
                                               10);
    if (g_boot_self_test_thread)
    {
        rt_thread_startup(g_boot_self_test_thread);
    }

    ret = openclaw_integration_init();
    if (ret != RT_EOK)
    {
        rt_kprintf("OpenClaw integration init failed: %d\n", ret);
    }

#if M55_ENABLE_LOCAL_HTTP_SERVER
    ret = http_server_init();
    if (ret != RT_EOK)
    {
        rt_kprintf("HTTP server init failed: %d\n", ret);
    }
#else
    rt_kprintf("M55 local HTTP server disabled; XiaoZhi voice relay uses outbound WebSocket\n");
#endif

    g_voice_boot_thread = rt_thread_create("voice_bt",
                                           voice_boot_thread_entry,
                                           RT_NULL,
                                           4096,
                                           16,
                                           10);
    if (g_voice_boot_thread)
    {
        rt_thread_startup(g_voice_boot_thread);
    }
#else
    rt_kprintf("[m55] WiFi+LVGL-only mode; voice/OpenClaw/HTTP/autoconnect disabled\n");
    (void)wifi_config_start_auto_connect(3500U);
    g_xiaozhi_bridge_thread = rt_thread_create("xz_bridge",
                                               xiaozhi_bridge_thread_entry,
                                               RT_NULL,
                                               4096,
                                               16,
                                               10);
    if (g_xiaozhi_bridge_thread)
    {
        rt_thread_startup(g_xiaozhi_bridge_thread);
    }

#if M55_XIAOZHI_AUTO_ENABLE
    g_xiaozhi_auto_thread = rt_thread_create("xz_auto",
                                             xiaozhi_auto_connect_thread_entry,
                                             RT_NULL,
                                             6144,
                                             17,
                                             10);
    if (g_xiaozhi_auto_thread)
    {
        rt_thread_startup(g_xiaozhi_auto_thread);
    }
#endif
#endif

    while (1)
    {
        rt_pin_write(LED_PIN_G, PIN_LOW);
        rt_thread_mdelay(500);
        rt_pin_write(LED_PIN_G, PIN_HIGH);
        rt_thread_mdelay(500);
    }

    return 0;
#endif
}
